FKDD_COPY_DIFF_3_2026-02-13/Enums/ns_Availability.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ns_Availability</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВНаличии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодЗаказ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Catalogs/ns_ЗапчастиИАксессуары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ns_ЗапчастиИАксессуары</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>AdStatus</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_AdStatus</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AdType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_AdType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AllowEmail</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_AllowEmail</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Availability</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_Availability</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AvitoId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Brand</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_ПроизводителиЗапчастей</v8:Type>
						<v8:Type>cfg:CatalogRef.ns_ПроизводителиШин</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Category</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_Category</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Condition</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_ConditionЗапчасти</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DateBegin</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DateEnd</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Homologation</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Id</Name>
					<Comment>Уникальный идентификатор объявления в вашей базе данных</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ListingFee</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_ListingFee</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LoadIndex</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Model</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>nsDescription</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OEM</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Originality</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_Originality</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OriginalOEM</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OriginalVendor</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ResidualTread</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RimBolts</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_RimBolts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RimBoltsDiameter</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_RimBoltsDiameter</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RimDiameter</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_RimDiameter</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RimOffset</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_RimOffset</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RimType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_RimTypeDisk</v8:Type>
						<v8:Type>cfg:EnumRef.ns_RimTypeWheels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RimWidth</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_RimWidth</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RunFlat</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SpeedIndex</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_SpeedIndex</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TireAspectRatio</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_TireAspectRatio</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TireSectionWidth</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_TireSectionWidthШины</v8:Type>
						<v8:Type>cfg:EnumRef.ns_TireSectionWidthМотошины</v8:Type>
						<v8:Type>cfg:EnumRef.ns_TireSectionWidthКолёса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TireType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_TireType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Title</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TypeId</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_TypeIdЗапчасти</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VideoURL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WheelAxle</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_WheelAxle</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выгружать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_ШаблоныОбъявлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЗаголовка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_ШаблоныЗаголовков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаПоказаОбъявления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_ЗоныПоказаОбъявления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Quantity</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TiresModels</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_TiresModels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/CommonModules/ns_ЗапчастиИАксессуары/Ext/Module.bsl
// Область НачальноеЗаполнение

Процедура ЗагрузитьПроизводителейЗапчастей(ПринудительнаяЗагрузка = Ложь) Экспорт
	НадоЗагружать = СправочникПроизводителейЗагружен();
	Если НадоЗагружать ИЛИ ПринудительнаяЗагрузка Тогда
		ЗагрузитьСправочникИзXML("ns_TiresBrands", "TiresBrands.xml", Справочники.ns_ПроизводителиШин);
		ЗагрузитьСправочникИзXML("ns_PartsBrands", "PartsBrands.xml", Справочники.ns_ПроизводителиЗапчастей);
	КонецЕсли; 
КонецПроцедуры

Процедура ЗагрузитьСправочникИзXML(ИмяМакета, ИмяXML, Менеджер)
	Каталог = КаталогВременныхФайлов();
	
	ДанныеМакета = ПолучитьОбщийМакет(ИмяМакета);
	ИмяФайлаXML = Каталог + ИмяXML;
	ДанныеМакета.Записать(ИмяФайлаXML);
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ИмяФайлаXML);
	
	СписокПроизводителейXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	Если ТипЗнч(СписокПроизводителейXDTO.Brand) = Тип("СписокXDTO") Тогда		
		ТекущиеДанные = ПолучитьТекущиеДанныеПроизводителей(Менеджер);
		
		Попытка
			НачатьТранзакцию();
			
			Для каждого Brand Из СписокПроизводителейXDTO.Brand Цикл
				Данные = ОбработатьXDTO(Brand, Менеджер, ТекущиеДанные);
			КонецЦикла; 	
			
			ЗафиксироватьТранзакцию();	
			ns_ОбщегоНазначения.СообщениеПользователю("Загружен справочник: " + ИмяМакета);
		Исключение
			Если ТранзакцияАктивна() Тогда
				ОтменитьТранзакцию();
			КонецЕсли; 
		    ns_ОбщегоНазначения.СообщениеПользователю(ОписаниеОшибки());
		КонецПопытки; 
	КонецЕсли;
	
	ЧтениеXML.Закрыть();
КонецПроцедуры

Функция СправочникПроизводителейЗагружен() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ns_ПроизводителиЗапчастей.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ns_ПроизводителиЗапчастей КАК ns_ПроизводителиЗапчастей";
	Запрос.УстановитьПараметр("", );
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли; 
	
КонецФункции

Функция ПолучитьТекущиеДанныеПроизводителей(Менеджер)
	ТекущиеДанные = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Производители.Ссылка КАК Ссылка,
	|	Производители.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ns_ПроизводителиШин КАК Производители";
	Если ТипЗнч(Менеджер) = Тип(Справочники.ns_ПроизводителиЗапчастей) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Справочник.ns_ПроизводителиШин", "Справочник.ns_ПроизводителиЗапчастей");	
	КонецЕсли; 
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ТекущиеДанные;
	КонецЕсли; 
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекущиеДанные.Вставить(Выборка.Наименование, Выборка.Ссылка);	
	КонецЦикла; 	

	Возврат ТекущиеДанные;
КонецФункции

Функция ОбработатьXDTO(Данные, Менеджер, ТекущиеДанные) Экспорт
	НайденныйЭлемент = ТекущиеДанные[Данные.name];
	Если НайденныйЭлемент = Неопределено Тогда
		НайденныйЭлемент = СоздатьОбновитьЭлемент(Данные, Менеджер);
	Иначе
		НайденныйЭлемент = СоздатьОбновитьЭлемент(Данные, Менеджер, НайденныйЭлемент);
	КонецЕсли;
	
	Возврат НайденныйЭлемент;
КонецФункции

Функция СоздатьОбновитьЭлемент(Данные, Менеджер, Ссылка = Неопределено)
	Если Ссылка = Неопределено Тогда
		ТекущийЭлемент = Менеджер.СоздатьЭлемент();
	Иначе
		ТекущийЭлемент = Ссылка.ПолучитьОбъект();
	КонецЕсли; 
	ТекущийЭлемент.Наименование = Данные.name;
	ТекущийЭлемент.Записать();
	
	Возврат ТекущийЭлемент.Ссылка;
КонецФункции

Функция СправочникЗапчастиСопоставлен() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ns_ЗапчастиИАксессуары.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ns_ЗапчастиИАксессуары КАК ns_ЗапчастиИАксессуары";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли; 
КонецФункции

Функция ЗаполнитьСправочникTypeId() Экспорт
	Попытка
		НачатьТранзакцию();
		
		НайтиИДобавитьЭлементTypeId("11-618", "Автосвет", Истина);
		НайтиИДобавитьЭлементTypeId("19-2855", "Автомобиль на запчасти", Истина);
		НайтиИДобавитьЭлементTypeId("11-619", "Аккумуляторы", Истина);
		НайтиИДобавитьЭлементTypeId("16-827", "Двигатель / Блок цилиндров, головка, картер", Истина);
		НайтиИДобавитьЭлементTypeId("16-828", "Двигатель / Вакуумная система", Истина);
		НайтиИДобавитьЭлементTypeId("16-829", "Двигатель / Генераторы, стартеры", Истина);
		НайтиИДобавитьЭлементTypeId("16-830", "Двигатель / Двигатель в сборе", Истина);
		НайтиИДобавитьЭлементTypeId("16-831", "Двигатель / Катушка зажигания, свечи, электрика", Истина);
		НайтиИДобавитьЭлементTypeId("16-832", "Двигатель / Клапанная крышка", Истина);
		НайтиИДобавитьЭлементTypeId("16-833", "Двигатель / Коленвал, маховик", Истина);
		НайтиИДобавитьЭлементTypeId("16-834", "Двигатель / Коллекторы", Истина);
		НайтиИДобавитьЭлементTypeId("16-835", "Двигатель / Крепление двигателя", Истина);
		НайтиИДобавитьЭлементTypeId("16-836", "Двигатель / Масляный насос, система смазки", Истина);
		НайтиИДобавитьЭлементTypeId("16-837", "Двигатель / Патрубки вентиляции", Истина);
		НайтиИДобавитьЭлементTypeId("16-838", "Двигатель / Поршни, шатуны, кольца", Истина);
		НайтиИДобавитьЭлементTypeId("16-839", "Двигатель / Приводные ремни, натяжители", Истина);
		НайтиИДобавитьЭлементTypeId("16-840", "Двигатель / Прокладки и ремкомплекты", Истина);
		НайтиИДобавитьЭлементTypeId("16-841", "Двигатель / Ремни, цепи, элементы ГРМ", Истина);
		НайтиИДобавитьЭлементTypeId("16-842", "Двигатель / Турбины, компрессоры", Истина);
		НайтиИДобавитьЭлементTypeId("16-843", "Двигатель / Электродвигатели и компоненты", Истина);
		НайтиИДобавитьЭлементTypeId("11-621", "Запчасти для ТО", Истина);
		НайтиИДобавитьЭлементTypeId("16-805", "Кузов / Балки, лонжероны", Истина);
		НайтиИДобавитьЭлементTypeId("16-806", "Кузов / Бамперы", Истина);
		НайтиИДобавитьЭлементTypeId("16-807", "Кузов / Брызговики", Истина);
		НайтиИДобавитьЭлементTypeId("16-808", "Кузов / Двери", Истина);
		НайтиИДобавитьЭлементTypeId("16-809", "Кузов / Заглушки", Истина);
		НайтиИДобавитьЭлементTypeId("16-810", "Кузов / Замки", Истина);
		НайтиИДобавитьЭлементTypeId("16-811", "Кузов / Защита", Истина);
		НайтиИДобавитьЭлементTypeId("16-812", "Кузов / Зеркала", Истина);
		НайтиИДобавитьЭлементTypeId("16-813", "Кузов / Кабина", Истина);
		НайтиИДобавитьЭлементTypeId("16-814", "Кузов / Капот", Истина);
		НайтиИДобавитьЭлементTypeId("16-815", "Кузов / Крепления", Истина);
		НайтиИДобавитьЭлементTypeId("16-816", "Кузов / Крылья", Истина);
		НайтиИДобавитьЭлементTypeId("16-817", "Кузов / Крыша", Истина);
		НайтиИДобавитьЭлементTypeId("16-818", "Кузов / Крышка, дверь багажника", Истина);
		НайтиИДобавитьЭлементTypeId("16-819", "Кузов / Кузов по частям", Истина);
		НайтиИДобавитьЭлементTypeId("16-820", "Кузов / Кузов целиком", Истина);
		НайтиИДобавитьЭлементTypeId("16-821", "Кузов / Лючок бензобака", Истина);
		НайтиИДобавитьЭлементTypeId("16-822", "Кузов / Молдинги, накладки", Истина);
		НайтиИДобавитьЭлементTypeId("16-823", "Кузов / Пороги", Истина);
		НайтиИДобавитьЭлементTypeId("16-824", "Кузов / Рама", Истина);
		НайтиИДобавитьЭлементTypeId("16-825", "Кузов / Решетка радиатора", Истина);
		НайтиИДобавитьЭлементTypeId("16-826", "Кузов / Стойка кузова", Истина);
		НайтиИДобавитьЭлементTypeId("11-623", "Подвеска", Истина);
		НайтиИДобавитьЭлементTypeId("11-624", "Рулевое управление", Истина);
		НайтиИДобавитьЭлементTypeId("11-625", "Салон", Истина);
		НайтиИДобавитьЭлементTypeId("16-521", "Система охлаждения", Истина);
		НайтиИДобавитьЭлементTypeId("11-626", "Стекла", Истина);
		НайтиИДобавитьЭлементTypeId("11-627", "Топливная и выхлопная системы", Истина);
		НайтиИДобавитьЭлементTypeId("11-628", "Тормозная система", Истина);
		НайтиИДобавитьЭлементTypeId("11-629", "Трансмиссия и привод", Истина);
		НайтиИДобавитьЭлементTypeId("11-630", "Электрооборудование", Истина);
		НайтиИДобавитьЭлементTypeId("6-401", "Запчасти / Для мототехники");
		НайтиИДобавитьЭлементTypeId("6-406", "Запчасти / Для спецтехники");
		НайтиИДобавитьЭлементTypeId("6-411", "Запчасти / Для водного транспорта");
		НайтиИДобавитьЭлементTypeId("4-943", "Аксессуары");
		НайтиИДобавитьЭлементTypeId("21", "GPS-навигаторы");
		НайтиИДобавитьЭлементTypeId("4-942", "Автокосметика и автохимия");
		НайтиИДобавитьЭлементTypeId("20", "Аудио и видеотехника");
		НайтиИДобавитьЭлементTypeId("4-964", "Багажники и фаркопы");
		НайтиИДобавитьЭлементTypeId("4-963", "Инструменты");
		НайтиИДобавитьЭлементTypeId("4-965", "Прицепы");
		НайтиИДобавитьЭлементTypeId("11-631", "Противоугонные устройства / Автосигнализации");
		НайтиИДобавитьЭлементTypeId("11-632", "Противоугонные устройства / Иммобилайзеры");
		НайтиИДобавитьЭлементTypeId("11-633", "Противоугонные устройства / Механические блокираторы");
		НайтиИДобавитьЭлементTypeId("11-634", "Противоугонные устройства / Спутниковые системы");
		НайтиИДобавитьЭлементTypeId("22", "Тюнинг");
		НайтиИДобавитьЭлементTypeId("10-048", "Шины");
		НайтиИДобавитьЭлементTypeId("10-047", "Мотошины");
		НайтиИДобавитьЭлементTypeId("10-046", "Диски");
		НайтиИДобавитьЭлементTypeId("10-045", "Колёса");
		НайтиИДобавитьЭлементTypeId("10-044", "Колпаки");
		НайтиИДобавитьЭлементTypeId("6-416", "Экипировка");
		
		ЗафиксироватьТранзакцию();		
	Исключение
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли; 
	    ns_ОбщегоНазначения.СообщениеПользователю(ОписаниеОшибки());
	КонецПопытки; 
	
КонецФункции

Процедура НайтиИДобавитьЭлементTypeId(Код, Наименование, Доступность = Ложь)
	Элемент = Справочники.ns_TypeIdЗапчасти.НайтиПоНаименованию(Наименование);
	Если НЕ ЗначениеЗаполнено(Элемент) Тогда
		ТекущийЭлемент = Справочники.ns_TypeIdЗапчасти.СоздатьЭлемент();
	Иначе	
		ТекущийЭлемент = Элемент.ПолучитьОбъект();
	КонецЕсли; 
	ТекущийЭлемент.Код = Код;
	ТекущийЭлемент.Наименование = Наименование;
	ТекущийЭлемент.Availability = Доступность; 
	ТекущийЭлемент.Записать();
КонецПроцедуры
 
// КонецОбласти

// Область Выгрузка

Функция ПолучитьДанныеНоменклатуры(МагазинСтрока) Экспорт
	
	Если ns_ОбщегоНазначенияПовтИсп.ПолучитьДобавлятьIDКатегории() Тогда
		Префикс = "zap-" + Строка(МагазинСтрока.Магазин.Префикс) + "-";
	Иначе
		Префикс = Строка(МагазинСтрока.Магазин.Префикс);
	КонецЕсли;	

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ns_ЗапчастиИАксессуары.Номенклатура КАК Номенклатура,
	|	ns_ЗапчастиИАксессуары.Title КАК Title,
	|	ns_ЗапчастиИАксессуары.AdStatus КАК AdStatus,
	|	ns_ЗапчастиИАксессуары.AdType КАК AdType,
	|	ns_ЗапчастиИАксессуары.AllowEmail КАК AllowEmail,
	|	ns_ЗапчастиИАксессуары.AvitoId КАК AvitoId,
	|	ns_ЗапчастиИАксессуары.Category КАК Category,
	|	ns_ЗапчастиИАксессуары.DateBegin КАК DateBegin,
	|	ns_ЗапчастиИАксессуары.DateEnd КАК DateEnd,
	|	&Префикс + ns_ЗапчастиИАксессуары.Id КАК Id,
	|	ns_ЗапчастиИАксессуары.ListingFee КАК ListingFee,
	|	ns_ЗапчастиИАксессуары.nsDescription КАК nsDescription,
	|	ns_ЗапчастиИАксессуары.RimBolts КАК RimBolts,
	|	ns_ЗапчастиИАксессуары.RimBoltsDiameter КАК RimBoltsDiameter,
	|	ns_ЗапчастиИАксессуары.RimDiameter КАК RimDiameter,
	|	ns_ЗапчастиИАксессуары.RimOffset КАК RimOffset,
	|	ns_ЗапчастиИАксессуары.RimType КАК RimType,
	|	ns_ЗапчастиИАксессуары.RimWidth КАК RimWidth,
	|	ns_ЗапчастиИАксессуары.TireAspectRatio КАК TireAspectRatio,
	|	ns_ЗапчастиИАксессуары.TireSectionWidth КАК TireSectionWidth,
	|	ns_ЗапчастиИАксессуары.TireType КАК TireType,
	|	ns_ЗапчастиИАксессуары.TypeId КАК TypeId,
	|	ns_ЗапчастиИАксессуары.VideoURL КАК VideoURL,
	|	ns_ЗапчастиИАксессуары.WheelAxle КАК WheelAxle,
	|	ns_ЗапчастиИАксессуары.OEM КАК OEM,
	|	ns_ЗапчастиИАксессуары.Шаблон КАК Шаблон,
	|	ns_ЗапчастиИАксессуары.Brand КАК Brand,
	|	0 КАК Price,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(17)) КАК ContactPhone,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(40)) КАК ManagerName,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(255)) КАК Address,
	|	ns_ЗапчастиИАксессуары.Артикул КАК Артикул,
	|	ns_ЗапчастиИАксессуары.Наименование КАК Наименование,
	|	ns_ЗапчастиИАксессуары.Характеристика КАК Характеристика,
	|	ns_ЗапчастиИАксессуары.Ссылка КАК Ссылка,
	|	ns_ЗапчастиИАксессуары.Condition КАК Condition,
	|	ns_ЗапчастиИАксессуары.Availability КАК Availability,
	|	ЕСТЬNULL(ns_ЗапчастиИАксессуары.TypeId.Availability, ЛОЖЬ) КАК TypeIdAvailability,
	|	ns_ЗапчастиИАксессуары.Homologation КАК Homologation,
	|	ns_ЗапчастиИАксессуары.LoadIndex КАК LoadIndex,
	|	ns_ЗапчастиИАксессуары.Model КАК Model,
	|	ns_ЗапчастиИАксессуары.OriginalOEM КАК OriginalOEM,
	|	ns_ЗапчастиИАксессуары.OriginalVendor КАК OriginalVendor,
	|	ns_ЗапчастиИАксессуары.ResidualTread КАК ResidualTread,
	|	ns_ЗапчастиИАксессуары.RunFlat КАК RunFlat,
	|	ns_ЗапчастиИАксессуары.SpeedIndex КАК SpeedIndex,
	|	ns_ЗапчастиИАксессуары.ЗонаПоказаОбъявления КАК ЗонаПоказаОбъявления,
	|	ns_ЗапчастиИАксессуары.TiresModels КАК TiresModels,
	|	ns_ЗапчастиИАксессуары.Quantity КАК Quantity
	|ИЗ
	|	Справочник.ns_ЗапчастиИАксессуары КАК ns_ЗапчастиИАксессуары
	|ГДЕ
	|	ns_ЗапчастиИАксессуары.ЭтоГруппа = ЛОЖЬ
	|	И ns_ЗапчастиИАксессуары.Выгружать = ИСТИНА";
	Запрос.УстановитьПараметр("Префикс", Префикс);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ЗаполнитьДополнительныеДанные(РезультатЗапроса.Выгрузить());
КонецФункции

Функция ЗаполнитьДополнительныеДанные(Выгрузка)
	
	УстанавливатьДоступностьПоОстаткам = ns_ОбщегоНазначенияПовтИсп.ПолучитьУстанавливатьДоступностьПоОстаткам();
	Если НЕ УстанавливатьДоступностьПоОстаткам = Неопределено И УстанавливатьДоступностьПоОстаткам Тогда
		Номенклатура = Выгрузка.ВыгрузитьКолонку("Номенклатура");
		Остатки = ns_Переопределяемый.ПолучитьТаблицуОстатков(Номенклатура);	
	
		Для каждого Строка Из Выгрузка Цикл
			Если ЗначениеЗаполнено(Строка.Availability) Тогда
				Продолжить;
			КонецЕсли;

			Если Строка.TypeIdAvailability = Ложь Тогда
				Продолжить;
			КонецЕсли;	
			
			Если ns_АвитоОбработкаОшибок.ЕстьОстаток(Строка, Остатки) Тогда
				Строка.Availability = Перечисления.ns_Availability.ВНаличии;	
			Иначе
				Строка.Availability = Перечисления.ns_Availability.ПодЗаказ;	
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	

	Возврат Выгрузка;
КонецФункции

// Область Выгрузка

//Область Сопоставление

Процедура Сопоставить(Ссылка, Характеристика, Родитель, ТаблицаСопоставления) Экспорт
	Изменен = Истина;
	
	СсылкаНаЭлемент = ns_Сопоставление.НайтиСопоставление(Ссылка, Характеристика, ТаблицаСопоставления);
	Если СсылкаНаЭлемент = Неопределено Тогда
		ОбъектЭлемент = Справочники.ns_ЗапчастиИАксессуары.СоздатьЭлемент();
		ОбъектЭлемент.Номенклатура = Ссылка;
		Если ЗначениеЗаполнено(Характеристика) Тогда
			ОбъектЭлемент.Характеристика = Характеристика;
			Id = Строка(Ссылка.УникальныйИдентификатор()) + "#" + Строка(Характеристика.УникальныйИдентификатор());
		Иначе
			Id = Строка(Ссылка.УникальныйИдентификатор());
		КонецЕсли; 
		ОбъектЭлемент.Id = Id;
		ОбъектЭлемент.Выгружать = ns_ОбщегоНазначенияПовтИсп.ПолучитьДобавлятьВВыгрузку();
		ОбъектЭлемент.Category = ns_ЗапчастиИАксессуарыПовтИсп.ПолучитьЗапчастиИАксессуары();
		ОбъектЭлемент.Condition = ns_ОбщегоНазначенияПовтИсп.ПолучитьConditionЗапчасти();
		ОбъектЭлемент.AdType = ns_ОбщегоНазначенияПовтИсп.ПолучитьAdType();
		
		Изменен = Истина;
	Иначе
		ОбъектЭлемент = СсылкаНаЭлемент.ПолучитьОбъект();
	КонецЕсли; 

	ns_Сопоставление.ЗаполнитьTitle(ОбъектЭлемент);
	ns_Сопоставление.ЗаполнитьDescription(Ссылка, ОбъектЭлемент);
	
	ОбъектЭлемент.ПометкаУдаления = Ссылка.ПометкаУдаления;
	ОбъектЭлемент.Наименование = Ссылка.Наименование;
	ОбъектЭлемент.Артикул = Ссылка.Артикул;
	ОбъектЭлемент.Родитель = Справочники.ns_ЗапчастиИАксессуары.ПолучитьСсылку(Родитель.УникальныйИдентификатор());
	
	Если Изменен Тогда
		ОбъектЭлемент.Записать();
	КонецЕсли; 
	
КонецПроцедуры

Процедура СопоставитьЭлементНоменклатуры(Ссылка) Экспорт
	ns_Сопоставление.СопоставитьЭлементНоменклатуры(Ссылка, "ns_ЗапчастиИАксессуары");			
КонецПроцедуры
 
//КонецОбласти
